In [1]:
import pandas as pd

In [4]:
names = ['alan','bob','charlie']
ages = [20,30,40]
city = ['NY','NY','TX']

In [5]:
mydata = list(zip(names,ages,city))

In [7]:
df = pd.DataFrame(data = mydata)

In [8]:
df

         0   1   2
0     alan  20  NY
1      bob  30  NY
2  charlie  40  TX

In [9]:
df = pd.DataFrame(data = mydata, columns=['names','ages','city'])

In [10]:
df

     names  ages city
0     alan    20   NY
1      bob    30   NY
2  charlie    40   TX

In [14]:
df = pd.DataFrame(data = mydata, columns=['names','ages','city'],index = ['one','two','three'])

In [15]:
df

         names  ages city
one       alan    20   NY
two        bob    30   NY
three  charlie    40   TX

In [17]:
df.loc[['one','two'],'names']

one    alan
two     bob
Name: names, dtype: object

In [25]:
df.to_csv('df.csv')

In [26]:
df2 = pd.read_csv('df.csv')

In [27]:
df2

  Unnamed: 0    names  ages city
0        one     alan    20   NY
1        two      bob    30   NY
2      three  charlie    40   TX

In [37]:
df.iloc[:,0]

one         alan
two          bob
three    charlie
Name: names, dtype: object

In [41]:
df2.index = df2.iloc[:,0]

In [47]:
del df2[df2.columns[0]]

In [48]:
df2

              names  ages city
Unnamed: 0
one            alan    20   NY
two             bob    30   NY
three       charlie    40   TX

In [56]:
df2.index.name = 'hi'

In [57]:
df2

         names  ages city
hi
one       alan    20   NY
two        bob    30   NY
three  charlie    40   TX

In [58]:
# Filter
df.loc[df['names']=='alan']

    names  ages city
one  alan    20   NY

In [64]:
# Select
df.loc[:,['ages']]

       ages
one      20
two      30
three    40

In [65]:
# Arrange
df.sort_values('ages',ascending=0)

         names  ages city
three  charlie    40   TX
two        bob    30   NY
one       alan    20   NY

In [66]:
# Mutate
df['FaveCity'] = df['city'] == 'NY'

In [67]:
df

         names  ages city  FaveCity
one       alan    20   NY      True
two        bob    30   NY      True
three  charlie    40   TX     False

In [69]:
# Groupby & Summarize
df.groupby('city').mean()

      ages  FaveCity
city
NY      25      True
TX      40     False